karate-gatling.yaml
# Blazemeter setup, comment to run locally
services:
  - module: shellexec
    prepare:
      # Setup Java 17
      - update-alternatives --set java /usr/lib/jvm/java-17-openjdk-amd64/bin/java
      # Download JAR file
      - wget -O examples-gatling-1.5.0-shaded.jar https://github.com/robgarciab/bzt-karate-demo/releases/download/v1.0.12/examples-gatling-1.5.0-shaded.jar

execution:
- executor: gatling
  scenario: karate
  concurrency: 10
  hold-for: 60

scenarios:
  karate:
    script: examples-gatling-1.5.0-shaded.jar
    #script: target/examples-gatling-1.5.0-shaded.jar
    simulation: mock.CatsKarateSimulation